# Список чисел
# На вход программе подается одно число n. Напишите программу, которая выводит список [1, 2, 3, ..., n].
#
# Формат входных данных
# На вход программе подается одно натуральное число.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

n = int(input())
print(list(range(1, n + 1)))

# пример ввода: 5
# вывод: [1, 2, 3, 4, 5]

