#  Число словами 🌶️
# Напишите функцию number_to_words(num), которая принимает в качестве аргумента натуральное число num и возвращает
# его словесное описание на русском языке.
#
# Примечание 1. Считайте, что число 1 ≤ num ≤ 99.
#
# Примечание 2. Следующий программный код:
#
# print(number_to_words(7))
# print(number_to_words(85))
# должен выводить:
#
# семь
# восемьдесят пять
# Тестовые данные 🟢
# объявление функции
def number_to_words(num):
    s = ['один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять', 'десять', 'одиннадцать',
         'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать',
         'девятнадцать', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят',
         'девяносто', '']
    if num <= 20:
        return s[num - 1]
    else:
        return s[num // 10 - 1 + 18] + ' ' + s[num % 10 - 1]


n = int(input())

# вызываем функцию
print(number_to_words(n))