# 1 Дополните приведенный код, используя срезы, так чтобы он вывел первые 12 символов строки s.

s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[:12])

# 2 Дополните приведенный код, используя срезы, так чтобы он вывел последние 9 символов строки s.

s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[-9:])

# 3 Дополните приведенный код, используя срезы, так чтобы он вывел каждый 7 символ строки s начиная от начала строки.

s = "In 2010, someone paid 10k Bitcoin for two pizzas."

print(s[:-1:7])

# 4 Дополните приведенный код, используя срезы, так чтобы он вывел строку s в обратном порядке.

s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[::-1])

# 