# В одну строку 1
# На вход программе подается строка текста, содержащая слова. Напишите программу, которая выводит слова введенной
# строки в столбик.
#
# Формат входных данных
# На вход программе подается строка текста, содержащая слова, разделенные символом пробела.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Примечание. Программу можно написать в одну строку кода.
#
# Тестовые данные 🟢
# Sample Input:
#
# Умей ценить того кто без тебя не может
# Sample Output:
#
# Умей
# ценить
# того
# кто
# без
# тебя
# не
# может

print(*[i for i in input().split()], sep='\n')